#	Πρόγραμμα που διαβάζει μια βάση δεδομένων (SQLite)
#	Δημιουργία: Νίκος-Νικήτας
#	-----------------------------------------
#	Program to read a SQLite database. 
#	Created by Nikos-Nikitas
#	-----------------------------------------

#η βιβλιοθήκη της βάσης δεδομένων ως sql για ευκολότερη χρήση
import sqlite3 as sql

#συνδεόμαστε στη βάση και
#χρησιμοποιούμε τον κέρσορα που ορίσαμε για να εκτελέσουμε εντολές
c = sql.connect("books.db")
cr = c.cursor()

#διαβάζουμε τη βάση με τη σύνδεσή μας και εκτελούμε
#διαλέγουμε και τυπώνουμε όλον τον πίνακα με τα βιβλία
#και μας δίνει όλα τα χαρακτηρηστικά που έχουμε βάλει.
#Το να έχουμε κώδικα σε συνάρτηση βοηθάει να τον επαναχρησιμοποιήσουμε :)
def readDb():
	with c:
		cr.execute("SELECT * FROM BOOKS")
		print(cr.fetchall())

readDb() #καλούμε τη συνάρτηση για να εκτελεστεί.
